"""
SugarCode的效果库与条件库
(聊天版)
"""

trigs = {
    "append": {"介绍": "(追加文本,(str))", "参数": ["str"]},
    "append2": {"介绍": "(追加数值,(float))", "参数": ["float"]},
    "finish": {"介绍": "(结束并发送文本(如果有文本),(传入的文本也会追加到末尾,若不想追加请填\"\"),(str))", "参数": ["str"]},
    "slic": {"介绍": "(对当前已有文本进行切片处理),(int,int,int),(起始下标,终止下标,步长),若填写“99999”则视为没填写", "参数": ["int", "int", "int"]},
    "newTempNum": {"介绍": "(新建临时变量，当整个触发器组运行完毕后就删除,[str,int](变量名，初始值))", "参数": ["str", "int"]},
    "toTempDigit": {"介绍": "(将一个字符串内容转化为数字,且赋值给一个临时变量,[str,str](字符串,临时变量名))", "参数": ["str", "str"]},
    "tempNumChange": {"介绍": "(临时变量改变,[str,int,float](变量名，改变模式[0-保留……位小数 1-加 2-减 3-乘 4-除 5-取余 6-次方 7-整除 8-开方 9-赋值 10-取较大 11-取较小]，改变量))", "参数": ["str", "int", "float"]},
    "userNumChange": {"介绍": "(私有变量改变[str,int,float](变量名，改变模式[0-保留……位小数 1-加 2-减 3-乘 4-除 5-取余 6-次方 7-整除 8-开方 9-赋值 10-取较大 11-取较小]，改变量))", "参数": ["str", "int", "float"]},
    "groupNumChange": {"介绍": "(群有变量改变[str,int,float](变量名，改变模式[0-保留……位小数 1-加 2-减 3-乘 4-除 5-取余 6-次方 7-整除 8-开方 9-赋值 10-取较大 11-取较小]，改变量))", "参数": ["str", "int", "float"]},
    "skip": {"介绍": "(跳过这整个触发组,[bool](T))", "参数": ["bool"]},
}
"""
SugarCode效果库
"""

needs = {
    "checkStart": {"介绍": "(匹配消息头,(str))", "参数": ["str"]},
    "checkEnd": {"介绍": "(匹配消息尾,(str))", "参数": ["str"]},
    "checkSize": {"介绍": "(判断消息长短,正为大于一个值,负为小于一个值,bool表示是否判断等于,(int,bool))", "参数": ["int", "bool"]},
    "checkMsg": {"介绍": "(判断消息整体是否为某段字符,(str))", "参数": ["str"]},
    "checkKeyword": {"介绍": "(判断消息内是否有某一段内容,(str))", "参数": ["str"]},
    "randomNum": {"介绍": "(随机数（开始就生成，1~100）的要求（正为最低，负为最高）,int)", "参数": ["int"]},
    "proba": {"介绍": "(完全随机数（监测该条件时就生成）该条件为真的几率为……(0~100),int)", "参数": ["int"]},
    "cprNums": {"介绍": "BUFF专属 (数值比较,[float,float,int](值1，值2，0-小于/1-等于/2-大于/3-小于等于/4-大于等于/5-不等于))", "参数": ["float", "float", "int"]},
    "isDigit": {"介绍": "(判断一个字符内容是否都是数字,(str))", "参数": ["str"]}
}
"""
SugarCode条件库
"""
